<template>
  <v-container>
    <v-row justify="center">
      <v-col cols="12" md="10">
        <v-card elevation="2" class="pa-4">
          <v-card-title class="text-h4 font-weight-bold mb-4 text-center">
            プライバシーポリシー
          </v-card-title>
          <v-divider class="mb-6" />

          <v-card-text class="text-body-1">
            <h2 class="text-h6 font-weight-bold mt-4 mb-2">
              1. 個人情報の利用目的
            </h2>
            <p class="mb-4">
              当サイトでは、お問い合わせの際などに個人情報をご提供いただく場合がございます。<br>
              取得した個人情報は、お問い合わせに対する回答や必要なご連絡のために利用し、それ以外の目的では利用いたしません。
            </p>

            <h2 class="text-h6 font-weight-bold mt-6 mb-2">
              2. アクセス解析ツールについて
            </h2>
            <p class="mb-4">
              当サイトでは、Googleによるアクセス解析ツール「Googleアナリティクス」を利用しています。<br>
              このトラフィックデータは匿名で収集されており、個人を特定するものではありません。この機能はCookieを無効にすることで収集を拒否することが出来ますので、お使いのブラウザの設定をご確認ください。
            </p>

            <h2 class="text-h6 font-weight-bold mt-6 mb-2">
              3. 広告の配信について
            </h2>
            <p class="mb-4">
              当サイトは、第三者配信の広告サービス（Google AdSenseなど）を利用する場合があります。<br>
              広告配信事業者は、ユーザーの興味に応じた広告を表示するためにCookieを使用することがあります。
            </p>

            <h2 class="text-h6 font-weight-bold mt-6 mb-2">
              4. 免責事項
            </h2>
            <p class="mb-4">
              当サイトからのリンクやバナーなどで移動したサイトで提供される情報、サービス等について一切の責任を負いません。<br>
              また当サイトのコンテンツ・情報について、できる限り正確な情報を提供するように努めておりますが、正確性や安全性を保証するものではありません。<br>
              当サイトに掲載された内容によって生じた損害等の一切の責任を負いかねますのでご了承ください。
            </p>

            <h2 class="text-h6 font-weight-bold mt-6 mb-2">
              5. 著作権について
            </h2>
            <p class="mb-4">
              当サイトは個人が運営する非公式のファンサイトであり、株式会社ポケモン、任天堂株式会社、Niantic, Inc.等の企業とは一切関係ありません。<br>
              当サイトで使用しているゲーム内の画像やデータの著作権・肖像権等は、各権利所有者に帰属致します。権利を侵害する目的ではありません。
            </p>

            <h2 class="text-h6 font-weight-bold mt-6 mb-2">
              6. 当サイトのオリジナルイラストの利用について
            </h2>
            <p class="mb-4">
              当サイトに掲載されている、管理人が手描きしたポケモンのイラストについては、個人的な範囲でご自由にご使用いただいて構いません。<br>
              ただし、ご使用の際は必ず、当サイトの名称とリンク（URL）をわかりやすい場所に明記してください。<br>
              また、イラストを利用した三次創作等の活動において、本家のポケモン（公式・原著作権者）のイメージを著しく損なう利用や、公式に迷惑がかかるような悪影響を及ぼす利用は固くお断りいたします。
            </p>

            <h2 class="text-h6 font-weight-bold mt-6 mb-2">
              7. プライバシーポリシーの変更について
            </h2>
            <p class="mb-4">
              当サイトは、本プライバシーポリシーの内容を適宜見直し、その改善に努めます。<br>
              本プライバシーポリシーは、事前の予告なく変更することがあります。変更後のプライバシーポリシーは、当サイトに掲載した時点から効力を生じるものとします。
            </p>
          </v-card-text>
        </v-card>
      </v-col>
    </v-row>
  </v-container>
</template>

<script setup lang="ts">
useHead({
  title: 'プライバシーポリシー'
})
</script>
